import re

common_verbs = [
    "روم", "روی", "رود", "رویم", "روید", "روند",
    "خواهم", "خواهی", "خواهد", "خواهیم", "خواهید", "خواهند",
    "بینم", "بینی", "بیند", "بینیم", "بینید", "بینند",
    "گیرم", "گیری", "گیرد", "گیریم", "گیرید", "گیرند",
    "خورم", "خوری", "خورد", "خوریم", "خورید", "خورند",
    "گویم", "گویی", "گوید", "گوییم", "گویید", "گویند",
    "دارم", "داری", "دارد", "داریم", "دارید", "دارند",
    "آورم", "آوری", "آورد", "آوریم", "آورید", "آورند",
    "شوم", "شوی", "شود", "شویم", "شوید", "شوند",
    "باشم", "باشی", "باشد", "باشیم", "باشید", "باشند",
    "نویسم", "نویسی", "نویسد", "نویسیم", "نویسید", "نویسند",
    "شنوم", "شنوی", "شنود", "شنویم", "شنوید", "شنوند",
    "فهمم", "فهمی", "فهمد", "فهمیم", "فهمید", "فهمند",
    "برم", "بری", "برد", "بریم", "برید", "برند",
    "مانم", "مانی", "ماند", "مانیم", "مانید", "مانند",
    "خوابم", "خوابی", "خوابد", "خوابیم", "خوابید", "خوابند",
    "دوم", "دوی", "دود", "دویم", "دوید", "دوند",
    "آموزم", "آموزی", "آموزد", "آموزیم", "آموزید", "آموزند",
    "پرم", "پری", "پرد", "پریم", "پرید", "پرند",
    "نشینم", "نشینی", "نشیند", "نشینیم", "نشینید", "نشینند",
    "شکنم", "شکنی", "شکند", "شکنیم", "شکنید", "شکنند",
    "پزم", "پزی", "پزد", "پزیم", "پزید", "پزند",
    "برمی‌دارم", "برمی‌داری", "برمی‌دارد", "برمی‌داریم", "برمی‌دارید", "برمی‌دارند",
    "زنم", "زنی", "زند", "زنیم", "زنید", "زنند",
    "بینم", "بینی", "بیند", "بینیم", "بینید", "بینند",
    "سازم", "سازی", "سازد", "سازیم", "سازید", "سازند",
    "شنوم", "شنوی", "شنود", "شنویم", "شنوید", "شنوند",
    "برم", "بری", "برد", "بریم", "برید", "برند",
    "خوانم", "خوانی", "خواند", "خوانیم", "خوانید", "خوانند",
    "نویسم", "نویسی", "نویسد", "نویسیم", "نویسید", "نویسند",
    "گیرم", "گیری", "گیرد", "گیریم", "گیرید", "گیرند",
    "زنم", "زنی", "زند", "زنیم", "زنید", "زنند",
    "بندم", "بندی", "بندد", "بندیم", "بندید", "بندند",
    "برم", "بری", "برد", "بریم", "برید", "برند",
    "پرسیم", "پرسی", "پرسد", "پرسیم", "پرسید", "پرسند",
    "خواهم", "خواهی", "خواهد", "خواهیم", "خواهید", "خواهند",
    "نشینم", "نشینی", "نشیند", "نشینیم", "نشینید", "نشینند",
    "دوزم", "دوزی", "دوزد", "دوزیم", "دوزید", "دوزند",
    "بازم", "بازی", "بازد", "بازیم", "بازید", "بازند",
    "شورم", "شوری", "شورد", "شوریم", "شورید", "شورند",
    "فروشم", "فروشی", "فروشد", "فروشیم", "فروشید", "فروشند",
    "بُرم", "بُری", "بُرد", "بُریم", "بُرید", "بُرند",
    "ریزم", "ریزی", "ریزد", "ریزیم", "ریزید", "ریزند",
    "دوم", "دوی", "دود", "دویم", "دوید", "دوند",
    "پذیرم", "پذیری", "پذیرد", "پذیریم", "پذیرید", "پذیرند",
    "فرستم", "فرستی", "فرستد", "فرستیم", "فرستید", "فرستند",
    "ببخشم", "ببخشی", "ببخشد", "ببخشیم", "ببخشید", "ببخشند",
    "ببویم", "ببویی", "ببوید", "ببوییم", "ببویید", "ببویند",
    "چینم", "چینی", "چیند", "چینیم", "چینید", "چینند",
    "کارم", "کاری", "کارد", "کاریم", "کارید", "کارند",
    "پوشم", "پوشی", "پوشد", "پوشیم", "پوشید", "پوشند",
    "برمی‌دارم", "برمی‌داری", "برمی‌دارد", "برمی‌داریم", "برمی‌دارید", "برمی‌دارند",
    "فهمانم", "فهمانی", "فهماند", "فهمانیم", "فهمانید", "فهمانند",
    "گذارم", "گذاری", "گذارد", "گذاریم", "گذارید", "گذارند",
    "آویزم", "آویزی", "آویزد", "آویزیم", "آویزید", "آویزند",
    "جوم", "جوی", "جود", "جویم", "جوید", "جوند",
    "سوزم", "سوزی", "سوزد", "سوزیم", "سوزید", "سوزند",
    "چرخم", "چرخی", "چرخد", "چرخیم", "چرخید", "چرخند",
    "خوانم", "خوانی", "خواند", "خوانیم", "خوانید", "خوانند",
    "پردازم", "پردازی", "پردازد", "پردازیم", "پردازید", "پردازند",
    "رفو کنم", "رفو کنی", "رفو کند", "رفو کنیم", "رفو کنید", "رفو کنند",
    "چاپ کنم", "چاپ کنی", "چاپ کند", "چاپ کنیم", "چاپ کنید", "چاپ کنند",
    "خندم", "خندی", "خندد", "خندیم", "خندید", "خندند",
    "بندم", "بندی", "بندد", "بندیم", "بندید", "بندند",
    "دوزم", "دوزی", "دوزد", "دوزیم", "دوزید", "دوزند",
    "بچسبانم", "بچسبانی", "بچسباند", "بچسبانیم", "بچسبانید", "بچسبانند",
    "کشم", "کشی", "کشد", "کشیم", "کشید", "کشند",
    "آزارم", "آزاری", "آزارد", "آزاریم", "آزارید", "آزارند",
    "ببرم", "ببری", "ببرد", "ببریم", "ببرید", "ببرند",
    "مانم", "مانی", "ماند", "مانیم", "مانید", "مانند",
    "زنم", "زنی", "زند", "زنیم", "زنید", "زنند",
    "شکافم", "شکافی", "شکافد", "شکافیم", "شکافید", "شکافند",
    "رسم", "رسی", "رسد", "رسیم", "رسید", "رسند",
    "آیم", "آیی", "آید", "آییم", "آیید", "آیند"
]


def cleanText(text):
    pattern = r'[!@#$%^&*()_\-+=\[\]{}\\|:;"\'<>?,./؟؛،]'
    cleaned_text = re.sub(pattern, ' ', text)
    cleaned_text = re.sub(r'\s+', ' ', cleaned_text).strip()
    return cleaned_text


def deleteHalfSpace(text):
    return re.sub(r'\u200c', '', text)

def normalizeVerb(text):
    for verb in common_verbs:
        pattern = rf'\bمی{verb}\b'
        replacement = f'می\u200c{verb}'
        text = re.sub(pattern, replacement, text)
    return text