const ar = {
  home: "الرئيسية",
  aboutUs: "من نحن",
  contactUs: "اتصل بنا",
  start: "ابدأ",
  profile: "الملف الشخصي",
  signUp: "إنشاء حساب",
  signIn: "تسجيل الدخول",
  report: "تقرير",
  synonym_title: "أداة تحليل دلالي ذكية",
  synonym_desc:
    "أدخل النص الخاص بك لتتيح لهذه الأداة المتقدمة التعرف على المعاني المرتبطة والتشابهات في الكلمات داخل الجمل. حل ذكي لتحسين الفهم الدلالي ومراجعة النصوص!",
  systemReady: "النظام جاهز للرد",
  startNow: "ابدأ الآن.",
  step1: {
    title: "الخطوة 1",
    description: "اكتب النص المطلوب، وسنضع خطًا تحت أي اقتراحات لدينا.",
  },
  step2: {
    title: "الخطوة 2",
    description: "مرر فوق أي اقتراح لرؤية التفاصيل.",
  },
  step3: {
    title: "الخطوة 3",
    description: "اضغط على الاقتراح لتطبيقه :D",
  },
  signUpOrSignIn: "إنشاء حساب / تسجيل الدخول",
};

export default ar;
