const ar = {
  home: "المنزل",
  aboutUs: "من نحن",
  contactUs: "اتصل بنا",
  start: "ابدأ",
  profile: "الحساب",
  signUp: "التسجيل",
  signIn: "تسجيل الدخول",
  report: "تقرير",
  synonym_title: "أداة التحليل الدلالي الذكية",
  synonym_desc:
    "أدخل النص الخاص بك لتحديد هذه الأداة المتقدمة للمعاني ذات الصلة والمرادفات للكلمات في جملتك. حل ذكي لتحسين الفهم الدلالي ومراجعة النصوص!",
  systemReady: "النظام جاهز للرد",
  startNow: "ابدأ الآن.",
  step1: {
    title: "الخطوة 1",
    description: "اكتب النص الذي تريده، وسنقوم بتسطير أي اقتراحات لدينا تحته",
  },
  step2: {
    title: "الخطوة 2",
    description: "يمكنك رؤية تفاصيل أي اقتراح عن طريق التحويم فوق الكلمة",
  },
  step3: {
    title: "الخطوة 3",
    description: "انقر لتطبيق الاقتراح D:",
  },
  signUpOrSignIn: "التسجيل / تسجيل الدخول",
  groupName: "المجموعة 3 + 1",
  aboutus: {
    summary: `في يوم من الأيام، في قرية بعيدة، قرر ثلاثة أصدقاء وهم معين، آرين، وأروين تحقيق حلمهم بأن يصبحوا مبرمجين ماهرين. لكنهم سمعوا أن عليهم اجتياز سبعة اختبارات برمجية لتحقيق ذلك.`,
    khan1: {
      title: "الأكواد المفقودة",
      text: `في بداية الرحلة، واجهوا جهاز كمبيوتر محمول كانت ملفات الكود فيه مشفرة. كان عليهم تصميم خوارزمية لكسر القفل. نيكا، التي كانت موهوبة في المنطق، صممت خوارزمية تكرارية ونجحوا في ذلك.`,
    },
    khan2: {
      title: "جدار الأخطاء",
      text: `في هذه المرحلة، كان عليهم إصلاح جدار ضخم من الكود مليء بالأخطاء. بارسا، الذي كان دائمًا ماهرًا في اكتشاف الأخطاء، تولى المهمة وبعد ساعات من العمل، أصلح جميع الأخطاء.`,
    },
    khan3: {
      title: "حرب CSS",
      text: `هنا كان أمير حسين محتجزًا، قاموا بإنقاذه وإضافته إلى المجموعة. أمير حسين، الذي كان مهتمًا بالمظهر، واجه تحديًا يتمثل في تصميم واجهة مستخدم جذابة باستخدام CSS. كانت هذه المهمة صعبة للغاية، ولكن بعد الدراسة والتجربة، تمكن من إنشاء تصميم رائع.`,
    },
    khan4: {
      title: "لقاء الخياط",
      text: `في منتصف الطريق، انضم إليهم شخص غريب يدعى "الخياط". كان الخياط مطورًا ومنشئ أدوات برمجية، وأعطاهم ملابس خاصة بخصائص فريدة. على سبيل المثال، جعلت ملابس أمير حسين مواقع الويب تبدو أجمل، بينما جعلت ملابس معين الأخطاء في الكود أكثر وضوحًا، وجعلت ملابس آرين الخوارزميات أكثر كفاءة.`,
    },
    khan5: {
      title: "الاختبار الليلي",
      text: `كان على المجموعة تصميم تطبيق يعمل دون أخطاء في ظلام الليل. نجحوا في اجتياز هذه المرحلة بمساعدة ملابسهم الجديدة.`,
    },
    khan6: {
      title: "غزو قاعدة البيانات",
      text: `في هذا الاختبار، واجهوا قاعدة بيانات فوضوية وغير منظمة. كان عليهم تنظيم البيانات وجعلها متكاملة. نجحوا في ذلك من خلال التعاون وتقسيم المهام.`,
    },
    khan7: {
      title: "الحلقات اللانهائية",
      text: `في هذه المرحلة، استولت الحلقات اللانهائية الأكثر شرًا على جهاز الكمبيوتر الخاص بهم. استخدم الخياط أداة سحرية، وهي المصحح، لإيقاف الحلقات.`,
    },
    khan8: {
      title: "المعركة مع شرك",
      text: `في النهاية، واجهوا شرك، الوحش الذي يمثل الأكواد المتكررة وغير المستقرة. أراد شرك إجبارهم على كتابة أكواد ضعيفة. ولكن باستخدام استراتيجية قوية (SOLID)، ومهارات بارسا في التصحيح، وتصميم أمير حسين المذهل، تمكنوا من هزيمة شرك.`,
    },
  },
  tooltip: {
    suggestion:
      "يمكنك استخدام <strong>{{word2}}</strong> بدلاً من <strong>{{word}}</strong>",
    apply: "تطبيق",
    discard: "تجاهل",
  },
  tags: {
    selectTag: "الرجاء اختيار كلمة لاستبدال {{word}}",
    cancel: "تراجع",
  },
  login: {
    title: "تسجيل الدخول",
    username: "اسم المستخدم",
    pass: "كلمة المرور",
  },
};

export default ar;
