const fa = {
  home: "خانه",
  aboutUs: "درباره ما",
  contactUs: "ارتباط با ما",
  start: "شروع",
  profile: "حساب کاربری",
  signUp: "ثبت نام",
  signIn: "ورود",
  report: "گزارش",
  synonym_title: "ابزار تحلیل معنایی هوشمند",
  synonym_desc:
    "متن خود را وارد کنید تا این ابزار پیشرفته، معانی مرتبط و مشابهات کلمات را در جمله شما شناسایی کند. راهکاری هوشمند برای بهبود درک معنایی و بازبینی متون!",
  systemReady: "سامانه آماده پاسخ گویی است",
  startNow: "همین حالا شروع کنید.",
  step1: {
    title: "مرحله 1",
    description:
      "متن مورد نظرتون رو بنویسین، ما هرجا پیشنهاد داشتیم زیرش خط می‌کشیم",
  },
  step2: {
    title: "مرحله 2",
    description:
      "جزئیات هر پیشنهادی که خواستید رو با هاور کردن روی اون کلمه میتونید ببینید",
  },
  step3: {
    title: "مرحله 3",
    description: "برای اعمال پیشنهاد، روش کلیک کنید D:",
  },
  signUpOrSignIn: "ثبت نام / ورود",
  groupName: "گروه 3 + 1",
  aboutus: {
    summary: `روزی روزگاری، در دهکده‌ای دور، سه دوست به نام‌های معین، آرین و آروین تصمیم گرفتند تا آرزوی دیرینه‌شان را برای تبدیل شدن به برنامه‌نویسان ماهر محقق کنند. اما شنیده بودند که برای رسیدن به این مقام باید از هفت‌خوان رستم برنامه‌نویسی عبور کنند.`,
    khan1: {
      title: " کدهای گمشده",
      text: `در آغاز مسیر، گروه با لپ‌تاپی روبرو شدند که فایل‌های کد آن رمزنگاری شده بود. برای عبور از این مرحله، باید الگوریتمی طراحی می‌کردند که قفل را بشکند. نیکا که استعداد خاصی در منطق داشت، یک الگوریتم بازگشتی طراحی کرد و موفق شدند.`,
    },
    khan2: {
      title: " دیوار باگ‌ها",
      text: `در این مرحله، باید دیوار عظیمی از کد پر از باگ را اصلاح می‌کردند. پارسا، که همیشه در شناسایی باگ‌ها استاد بود، دست به کار شد و پس از ساعت‌ها تلاش، همه‌ی باگ‌ها را رفع کرد.`,
    },
    khan3: {
      title: "جنگ با CSS",
      text: `اینجا امیرحسین زندانی شده بود، نجاتش میدن و به گروهشون اضافه می کننش، امیرحسین  که بیشتر به ظاهر علاقه داشت، با چالشی روبرو شد که باید یک رابط کاربری جذاب با استفاده از CSS طراحی می‌کرد. این خوان برای او بسیار دشوار بود، اما پس از مطالعه و آزمون و خطا، توانست دیزاینی بی‌نقص خلق کند.`,
    },
    khan4: {
      title: "ملاقات با خیاط",
      text: `در میانه‌ی مسیر، فردی عجیب به نام "خیاط" به آنها پیوست. خیاط که یک توسعه‌دهنده و خالق ابزارهای برنامه‌نویسی بود، به آنها لباس‌های مخصوصی داد که هر کدام ویژگی خاصی داشت. مثلاً لباس امیرحسین، ظاهر سایت‌ها را زیباتر می‌کرد. لباس معین، خطاها را در کد برجسته می‌کرد و لباس آرین، الگوریتم‌ها را بهینه‌تر می‌ساخت.`,
    },
    khan5: {
      title: "خوان چهارم: آزمایش شبانه",
      text: `گروه باید یک برنامه کاربردی طراحی می‌کردند که در تاریکی شب بدون خطا اجرا شود. آنها با کمک لباس‌های جدیدشان این مرحله را با موفقیت گذراندند.`,
    },
    khan6: {
      title: "خوان پنجم: تسخیر پایگاه داده",
      text: `در این خوان، پایگاه داده‌ای وحشی و بی‌نظم در انتظارشان بود. آنها باید داده‌ها را مرتب و یکپارچه می‌کردند. با همکاری و تقسیم وظایف، موفق شدند.`,
    },
    khan7: {
      title: "خوان ششم: حلقه‌های بی‌پایان",
      text: `در این مرحله، شرورانه‌ترین حلقه‌های بی‌پایان کد، کامپیوترشان را به تسخیر درآورده بود. خیاط با استفاده از یک ابزار جادویی، دیباگر، حلقه‌ها را متوقف کرد.`,
    },
    khan8: {
      title: "خوان هفتم: نبرد با شرک",
      text: `در نهایت، آنها با شرک، هیولایی که نماینده کدهای تکراری و ناپایدار بود، روبرو شدند. شرک می‌خواست آنها را مجبور کند که کدهای ضعیف و بی‌کیفیت بنویسند. اما آروین با یک استراتژی قوی (SOLID)، پارسا با مهارت دیباگ، و امیرحسین با طراحی خیره‌کننده، شرک را شکست دادند.`,
    },
  },
  tooltip: {
    suggestion:
      "شما میتونید به جای <strong>{{word}}</strong> از <strong>{{word2}}</strong> استفاده کنید",
    apply: "اعمال",
    discard: "دور انداختن",
  },
  tags: {
    selectTag: "لطفا یک کلمه را برای جای گزینی {{word}} انتخاب کنید",
    cancel: "پشیمون شدم",
  },
  login: {
    title: "ورود",
    username: "نام کاربری",
    pass: "رمز عبور",
  },
};

export default fa;
