const fa = {
  home: "خانه",
  aboutUs: "درباره ما",
  contactUs: "ارتباط با ما",
  start: "شروع",
  profile: "حساب کاربری",
  signUp: "ثبت نام",
  signIn: "ورود",
  report: "گزارش",
  synonym_title: "ابزار تحلیل معنایی هوشمند",
  synonym_desc:
    "متن خود را وارد کنید تا این ابزار پیشرفته، معانی مرتبط و مشابهات کلمات را در جمله شما شناسایی کند. راهکاری هوشمند برای بهبود درک معنایی و بازبینی متون!",
  systemReady: "سامانه آماده پاسخ گویی است",
  startNow: "همین حالا شروع کنید.",
  step1: {
    title: "مرحله 1",
    description:
      "متن مورد نظرتون رو بنویسین، ما هرجا پیشنهاد داشتیم زیرش خط می‌کشیم",
  },
  step2: {
    title: "مرحله 2",
    description:
      "جزئیات هر پیشنهادی که خواستید رو با هاور کردن روی اون کلمه میتونید ببینید",
  },
  step3: {
    title: "مرحله 3",
    description: "برای اعمال پیشنهاد، روش کلیک کنید D:",
  },
  signUpOrSignIn: "ثبت نام / ورود",
};

export default fa;
