const hi = {
  home: "होम",
  aboutUs: "हमारे बारे में",
  contactUs: "संपर्क करें",
  start: "शुरू करें",
  profile: "प्रोफ़ाइल",
  signUp: "साइन अप",
  signIn: "साइन इन",
  report: "रिपोर्ट",
  synonym_title: "इंटेलिजेंट सिमेंटिक एनालिसिस टूल",
  synonym_desc:
    "अपना टेक्स्ट दर्ज करें, और यह उन्नत टूल आपके वाक्य में शब्दों के संबंधित अर्थ और समानार्थी शब्दों की पहचान करेगा। सिमेंटिक समझ और टेक्स्ट रिविजन को सुधारने के लिए एक स्मार्ट समाधान!",
  systemReady: "सिस्टम प्रतिक्रिया देने के लिए तैयार है",
  startNow: "अभी शुरू करें।",
  step1: {
    title: "चरण 1",
    description:
      "अपना वांछित टेक्स्ट लिखें, और हम उसके नीचे किसी भी सुझाव को रेखांकित करेंगे।",
  },
  step2: {
    title: "चरण 2",
    description: "आप किसी भी सुझाव का विवरण देख सकते हैं शब्द पर होवर करके।",
  },
  step3: {
    title: "चरण 3",
    description: "सुझाव लागू करने के लिए क्लिक करें D:",
  },
  signUpOrSignIn: "साइन अप / साइन इन",
  groupName: "समूह 3 + 1",
  aboutus: {
    summary: `एक बार की बात है, एक दूर के गाँव में, तीन दोस्त मोएन, अरिन और अरविन ने अपने सपने को पूरा करने का फैसला किया कि वे कुशल प्रोग्रामर बनें। लेकिन उन्होंने सुना कि इस लक्ष्य को प्राप्त करने के लिए उन्हें सात प्रोग्रामिंग चुनौतियों को पार करना होगा।`,
    khan1: {
      title: "खोए हुए कोड",
      text: `अपनी यात्रा की शुरुआत में, उन्हें एक लैपटॉप मिला जिसमें एन्क्रिप्टेड कोड फाइलें थीं। उन्हें ताला तोड़ने के लिए एक एल्गोरिदम डिजाइन करना था। निका, जिसे तर्क में प्रतिभा थी, ने एक पुनरावर्ती एल्गोरिदम डिजाइन किया, और वे सफल हुए।`,
    },
    khan2: {
      title: "बग्स की दीवार",
      text: `इस चरण में, उन्हें बग्स से भरी एक विशाल कोड की दीवार को ठीक करना था। पारसा, जो हमेशा बग्स की पहचान करने में कुशल था, ने काम संभाला और घंटों की मेहनत के बाद सभी बग्स को ठीक कर दिया।`,
    },
    khan3: {
      title: "सीएसएस युद्ध",
      text: `यहाँ, अमीरहोसेन को कैद कर लिया गया था, और उन्होंने उसे बचाया और अपने समूह में शामिल कर लिया। अमीरहोसेन, जो दिखावट में अधिक रुचि रखते थे, को सीएसएस का उपयोग करके एक आकर्षक यूजर इंटरफेस डिजाइन करने की चुनौती का सामना करना पड़ा। यह कार्य बहुत कठिन था, लेकिन अध्ययन और प्रयोग के बाद, उन्होंने एक शानदार डिजाइन बनाया।`,
    },
    khan4: {
      title: "दर्जी से मुलाकात",
      text: `आधे रास्ते में, एक अजीब व्यक्ति जिसे "दर्जी" कहा जाता था, उनके साथ जुड़ गया। दर्जी एक डेवलपर और प्रोग्रामिंग टूल्स का निर्माता था, और उसने उन्हें विशेष कपड़े दिए जिनमें अद्वितीय विशेषताएं थीं। उदाहरण के लिए, अमीरहोसेन के कपड़े वेबसाइटों को और सुंदर बना देते थे, जबकि मोएन के कपड़े कोड में त्रुटियों को उजागर करते थे, और अरिन के कपड़े एल्गोरिदम को अधिक कुशल बना देते थे।`,
    },
    khan5: {
      title: "रात की परीक्षा",
      text: `समूह को एक एप्लिकेशन डिजाइन करना था जो रात के अंधेरे में बिना किसी त्रुटि के काम करे। उन्होंने अपने नए कपड़ों की मदद से इस चरण को पार कर लिया।`,
    },
    khan6: {
      title: "डेटाबेस पर विजय",
      text: `इस चुनौती में, उन्हें एक जंगली और अव्यवस्थित डेटाबेस का सामना करना पड़ा। उन्हें डेटा को व्यवस्थित और एकीकृत करना था। सहयोग और कार्य विभाजन के माध्यम से वे सफल हुए।`,
    },
    khan7: {
      title: "अनंत लूप",
      text: `इस चरण में, कोड के सबसे दुष्ट अनंत लूप ने उनके कंप्यूटर पर कब्जा कर लिया। दर्जी ने एक जादुई उपकरण, डिबगर का उपयोग करके लूप को रोक दिया।`,
    },
    khan8: {
      title: "श्रेक के साथ युद्ध",
      text: `अंत में, उन्हें श्रेक का सामना करना पड़ा, वह राक्षस जो दोहराए जाने वाले और अस्थिर कोड का प्रतिनिधित्व करता था। श्रेक उन्हें कमजोर कोड लिखने के लिए मजबूर करना चाहता था। लेकिन एक मजबूत रणनीति (SOLID), पारसा की डिबगिंग कौशल, और अमीरहोसेन के शानदार डिजाइन के साथ, उन्होंने श्रेक को हरा दिया।`,
    },
  },
  tooltip: {
    suggestion:
      "आप <strong>{{word2}}</strong> के बजाय <strong>{{word}}</strong> का उपयोग कर सकते हैं",
    apply: "लागू करें",
    discard: "खारिज करें",
  },
  tags: {
    selectTag: "कृपया {{word}} को बदलने के लिए एक शब्द चुनें",
    cancel: "रद्द करें",
  },
  login: {
    title: "लॉगिन",
    username: "उपयोगकर्ता नाम",
    pass: "पासवर्ड",
  },
};

export default hi;
