const ko = {
  home: "홈",
  aboutUs: "회사 소개",
  contactUs: "연락처",
  start: "시작",
  profile: "프로필",
  signUp: "가입",
  signIn: "로그인",
  report: "보고서",
  synonym_title: "지능형 의미 분석 도구",
  synonym_desc:
    "텍스트를 입력하면 이 고급 도구가 문장에서 단어의 관련 의미와 동의어를 식별합니다. 의미 이해와 텍스트 수정을 개선하는 스마트한 솔루션!",
  systemReady: "시스템이 응답할 준비가 되었습니다",
  startNow: "지금 시작하세요.",
  step1: {
    title: "1단계",
    description:
      "원하는 텍스트를 작성하면 아래에 제안 사항을 밑줄로 표시합니다.",
  },
  step2: {
    title: "2단계",
    description:
      "단어 위에 마우스를 올려 제안 사항의 세부 정보를 볼 수 있습니다.",
  },
  step3: {
    title: "3단계",
    description: "제안 사항을 적용하려면 클릭하세요 D:",
  },
  signUpOrSignIn: "가입 / 로그인",
  groupName: "3 + 1 그룹",
  aboutus: {
    summary: `옛날 옛적에 먼 마을에서 Moein, Arin, Arvin이라는 세 친구가 숙련된 프로그래머가 되기 위해 꿈을 이루기로 결심했습니다. 하지만 그들은 이를 달성하기 위해 일곱 가지 프로그래밍 도전을 통과해야 한다는 말을 들었습니다.`,
    khan1: {
      title: "잃어버린 코드",
      text: `여행의 시작에서 그들은 암호화된 코드 파일이 있는 노트북을 발견했습니다. 그들은 자물쇠를 풀기 위해 알고리즘을 설계해야 했습니다. 논리에 재능이 있는 Nika가 재귀 알고리즘을 설계했고, 그들은 성공했습니다.`,
    },
    khan2: {
      title: "버그의 벽",
      text: `이 단계에서 그들은 버그로 가득 찬 거대한 코드 벽을 수리해야 했습니다. 버그를 식별하는 데 항상 능숙했던 Parsa가 작업을 맡아 몇 시간 동안 노력한 끝에 모든 버그를 수정했습니다.`,
    },
    khan3: {
      title: "CSS 전쟁",
      text: `여기서 Amirhossein은 감옥에 갇혔고, 그들은 그를 구출하여 그룹에 추가했습니다. 외관에 더 관심이 많았던 Amirhossein은 CSS를 사용하여 매력적인 사용자 인터페이스를 설계하는 도전에 직면했습니다. 이 작업은 매우 어려웠지만, 연구와 실험 끝에 그는 놀라운 디자인을 만들었습니다.`,
    },
    khan4: {
      title: "재단사와의 만남",
      text: `중간에 "재단사"라는 이상한 사람이 그들과 합류했습니다. 재단사는 개발자이자 프로그래밍 도구 제작자였으며, 그들에게 독특한 기능을 가진 특별한 옷을 주었습니다. 예를 들어, Amirhossein의 옷은 웹사이트를 더 아름답게 만들었고, Moein의 옷은 코드의 오류를 강조했으며, Arin의 옷은 알고리즘을 더 효율적으로 만들었습니다.`,
    },
    khan5: {
      title: "야간 테스트",
      text: `그룹은 어둠 속에서 완벽하게 작동하는 애플리케이션을 설계해야 했습니다. 그들은 새로운 옷의 도움으로 이 단계를 통과했습니다.`,
    },
    khan6: {
      title: "데이터베이스 정복",
      text: `이 도전에서 그들은 야생적이고 무질서한 데이터베이스를 마주했습니다. 그들은 데이터를 조직하고 통합해야 했습니다. 협력과 작업 분담을 통해 그들은 성공했습니다.`,
    },
    khan7: {
      title: "무한 루프",
      text: `이 단계에서 가장 사악한 무한 루프 코드가 그들의 컴퓨터를 점령했습니다. 재단사는 디버거라는 마법의 도구를 사용하여 루프를 멈췄습니다.`,
    },
    khan8: {
      title: "슈렉과의 전투",
      text: `마지막으로, 그들은 반복적이고 불안정한 코드를 대표하는 괴물 슈렉과 마주했습니다. 슈렉은 그들에게 약한 코드를 쓰도록 강요하려 했습니다. 하지만 강력한 전략(SOLID), Parsa의 디버깅 기술, 그리고 Amirhossein의 놀라운 디자인으로 그들은 슈렉을 물리쳤습니다.`,
    },
  },
  tooltip: {
    suggestion:
      "<strong>{{word2}}</strong> 대신 <strong>{{word}}</strong>를 사용할 수 있습니다",
    apply: "적용",
    discard: "취소",
  },
  tags: {
    selectTag: "{{word}}를 대체할 단어를 선택하세요",
    cancel: "취소",
  },
  login: {
    title: "로그인",
    username: "사용자 이름",
    pass: "비밀번호",
  },
};

export default ko;
