const ru = {
  home: "Главная",
  aboutUs: "О нас",
  contactUs: "Связаться с нами",
  start: "Начать",
  profile: "Профиль",
  signUp: "Регистрация",
  signIn: "Войти",
  report: "Отчет",
  synonym_title: "Интеллектуальный инструмент семантического анализа",
  synonym_desc:
    "Введите свой текст, и этот продвинутый инструмент определит связанные значения и синонимы слов в вашем предложении. Умное решение для улучшения семантического понимания и редактирования текста!",
  systemReady: "Система готова к ответу",
  startNow: "Начните сейчас.",
  step1: {
    title: "Шаг 1",
    description:
      "Напишите желаемый текст, и мы подчеркнем любые предложения под ним.",
  },
  step2: {
    title: "Шаг 2",
    description:
      "Вы можете увидеть детали любого предложения, наведя курсор на слово.",
  },
  step3: {
    title: "Шаг 3",
    description: "Нажмите, чтобы применить предложение D:",
  },
  signUpOrSignIn: "Регистрация / Вход",
  groupName: "Группа 3 + 1",
  aboutus: {
    summary: `Однажды в далекой деревне три друга по имени Моэин, Арин и Арвин решили осуществить свою мечту стать опытными программистами. Но они услышали, что для этого им нужно пройти семь испытаний по программированию.`,
    khan1: {
      title: "Потерянные коды",
      text: `В начале своего пути они нашли ноутбук с зашифрованными файлами кода. Им нужно было разработать алгоритм, чтобы взломать замок. Ника, у которой был талант к логике, разработала рекурсивный алгоритм, и они преуспели.`,
    },
    khan2: {
      title: "Стена багов",
      text: `На этом этапе им нужно было исправить огромную стену кода, заполненную багами. Парса, который всегда был искусен в обнаружении багов, взялся за работу и после часов труда исправил все баги.`,
    },
    khan3: {
      title: "Война CSS",
      text: `Здесь Амирхоссейн был заключен в тюрьму, и они спасли его и добавили в свою группу. Амирхоссейн, который больше интересовался внешним видом, столкнулся с задачей создания привлекательного пользовательского интерфейса с использованием CSS. Эта задача была очень сложной, но после изучения и экспериментов он смог создать потрясающий дизайн.`,
    },
    khan4: {
      title: "Встреча с портным",
      text: `На полпути к ним присоединился странный человек по имени "Портной". Портной был разработчиком и создателем инструментов программирования, и он дал им специальную одежду с уникальными функциями. Например, одежда Амирхоссейна делала сайты красивее, а одежда Моэина выделяла ошибки в коде, а одежда Арина делала алгоритмы более эффективными.`,
    },
    khan5: {
      title: "Ночное испытание",
      text: `Группе нужно было разработать приложение, которое работало бы без ошибок в ночной темноте. Они прошли этот этап с помощью своей новой одежды.`,
    },
    khan6: {
      title: "Завоевание базы данных",
      text: `В этом испытании они столкнулись с дикой и неорганизованной базой данных. Им нужно было организовать и интегрировать данные. Они преуспели благодаря сотрудничеству и разделению задач.`,
    },
    khan7: {
      title: "Бесконечные циклы",
      text: `На этом этапе самые зловещие бесконечные циклы кода захватили их компьютер. Портной использовал магический инструмент, отладчик, чтобы остановить циклы.`,
    },
    khan8: {
      title: "Битва с Шреком",
      text: `Наконец, они столкнулись с Шреком, монстром, представляющим повторяющийся и нестабильный код. Шрек хотел заставить их писать слабый код. Но с помощью сильной стратегии (SOLID), навыков отладки Парсы и потрясающего дизайна Амирхоссейна они победили Шрека.`,
    },
  },
  tooltip: {
    suggestion:
      "Вы можете использовать <strong>{{word2}}</strong> вместо <strong>{{word}}</strong>",
    apply: "Применить",
    discard: "Отклонить",
  },
  tags: {
    selectTag: "Пожалуйста, выберите слово для замены {{word}}",
    cancel: "Отмена",
  },
  login: {
    title: "Вход",
    username: "Имя пользователя",
    pass: "Пароль",
  },
};

export default ru;
